#include "functions.h"
#include <iostream>
#include "libutils/io.h"
/*Иерархия классов: функции от одной переменной
.
Обеспечить, как минимум, следующее общее поведение:
•вычисление значения функции при заданном аргументе;
•получение функции, являющейся производной от текущей;
Предоставить, как минимум, следующие типы  данных:

константа;
линейная функция;
квадратичная функция;
синус;
косинус.

В основном меню приложения предоставить возможность определения функции в контейнере, 
производная которой для заданного аргумента принимает наименьшее значение
.
Результат выводить ввиде:«изначальная функция; производная;значение производной»
. Если таких функций несколько, вывести первую из них
.Вычисление организовать двумя способами: своим кодом и с использованием библиотеки стандартных алгоритмов.*/
